title: LSASS Access for Credential Dumping
id: 002-credential-dumping-lsass
status: stable
description: Detects suspicious access to LSASS memory.
author: BLUETeam SOC-N5
logsource:
  product: windows
  category: process_access
detection:
  selection:
    TargetImage: 'C:\Windows\System32\lsass.exe'
    GrantedAccess: '0x1fffff'
  condition: selection
level: critical
tags:
  - attack.credential_access
  - attack.t1003
