title: PsExec Lateral Movement Detection
id: 001-lateral-movement-psexec
status: stable
description: Detects PsExec usage indicating lateral movement.
author: BLUETeam SOC-N5
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith: '\psexec.exe'
  condition: selection
fields:
  - Image
  - CommandLine
  - ParentImage
level: high
tags:
  - attack.lateral_movement
  - attack.t1021.002
