title: Webshell Execution Activity
id: 003-webshell-activity
status: stable
description: Detects suspicious execution of commands via web server processes.
author: BLUETeam SOC-N5
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    ParentImage|contains:
      - 'w3wp.exe'
      - 'php-cgi.exe'
      - 'apache.exe'
    CommandLine|contains:
      - 'cmd.exe'
      - 'powershell'
  condition: selection
level: high
tags:
  - attack.persistence
  - attack.t1505.003
